{"manga": [ 
    {
      "title": "Code geass",
      "synopsis": "After invading Japan using giant robot weapons called Knightmares, the powerful Empire of Britannia takes over the country and renames it \"Area 11\" and its people, \"Elevens.\" In the socially stratified society, the Japanese are forced to live poor, suppressed lives while the Briannians are respected and live lavishly. Although rebel groups of Japanese do rise up, they are usually crushed by Britannia forces.\n\nWhen his mother is assassinated, former prince of Britannia Lelouch renounces his entitlement to the throne and accuses his unconcerned father, the king of Britannia, of leaving his mother defenseless. After being banished to Japan along with his sister Nunnally (who became blind and unable to walk after getting caught up in their mother's violent assassination), Lelouch swears to his best friend Suzaku that he will destroy Britannia some day. Years later, while hiding out in Area 11 and attending the Britannian school Ashford Academy, Lelouch accidentally gets caught up in a terrorist raid on a military secret; that \"secret\" ends up being a mysterious girl named C.C., and when Lelouch unwittingly discovers her, she grants him the power of Geass, which allows him to control anyone just by looking into their eyes. At the same time, Lelouch also discovers that Suzaku is now working for the Britannia military, the very military that Lelouch is hoping to destroy.",
      "demographic": "Seinen",
      "author": "Ichirō Ōkouchi",
      "genre": "Alternate history, mecha, military",
      "runDate": "December 26, 2006",
      "endDate": "August 9, 2008",
      "IMG": "https://images-na.ssl-images-amazon.com/images/I/71b6uVcU8aL._SL1200_.jpg",
      "characters": [
        {
          "name": "Lelouch vi Britannia",
          "age": "18",
          "birthday": "December 5, 1999",
          "gender": "Male",
          "height": "178 cm",
          "status": "Deceased",
          "description": "Is the protagonist of Code Geass: Lelouch of the Rebellion and Code Geass: Lelouch of the Rebellion R2, and plays a supporting role in sidestories like Code Geass: Oz the Reflection and Code Geass: Lancelot & Guren. After he was exiled he used the alias, Lelouch Lamperouge. He was the Eleventh Prince of the Holy Britannian Empire and the son of the 98th Emperor of Britannia, Charles zi Britannia. He was also the leader of the Black Knights and the real identity of Zero. He is voiced by Jun Fukuyama, while his child self is voiced by Sayaka Ohara. His English dub voice is provided by Johnny Yong Bosch with Michelle Ruff doing Lelouch's child voice.",
          "IMGchar": "https://i.ytimg.com/vi/7PtggAmd5wk/maxresdefault.jpg"
        },
        {
          "name": "C.C.",
          "age": "16",
          "birthday": "Unknown",
          "gender": "Female",
          "height": "168 cm",
          "status": "Alive",
          "description": "Is the tritagonist of Code Geass: Lelouch of the Rebellion. Her seiyu is Yukana while she is voiced by Kate Higgins in the English dub. C.C. is not her real name; she involuntarily reveals her real name to Lelouch in her sleep, but it is muted so the viewers cannot hear it.",
          "IMGchar": "https://toppng.com/uploads/preview/cc-code-geass-11562990728dk3bcqmufn.png"
        },
        {
          "name": "Suzaku Kururugi",
          "age": "18",
          "birthday": "July 10, 2000",
          "gender": "Male",
          "height": "1.76 m",
          "status": "Alive",
          "description": "Is the deuteragonist of the Sunrise anime series Code Geass: Lelouch of the Rebellion, one of the antagonists of Code Geass: Akito the Exiled, and one of the protagonists of Code Geass: Lancelot & Guren. He is voiced by Takahiro Sakurai, while his child self is voiced by Akeno Watanabe. He is voiced by Yuri Lowenthal in the English dub, and his child self is voiced by Laura Bailey. In the 29th Anime Grand Prix, he was placed sixth with 143 votes, then 19th and 13th, respectively, in the following two.",
          "IMGchar": "https://www.pikpng.com/pngl/m/336-3362373_code-geass-suzaku-kururugi-png-png-download-code.png"
        },
        {
          "name": "Cornelia li Britannia",
          "age": "28",
          "birthday": "January 13th 1990",
          "gender": "Female",
          "height": "180 cm",
          "status": "Alive",
          "description": "Is the second princess of the Britannian Imperial Family and is Lelouch's half-sister. She is extremely skilled in Knightmare Frame combat and completed the establishment of Area 18 shortly before arriving in Area 11. She serves as one of the main antagonists during the first season, but later becomes a neutral character during the second.",
          "IMGchar": "https://vignette.wikia.nocookie.net/codegeass/images/2/24/Cornelia_li_Britannia.jpg/revision/latest/scale-to-width-down/340?cb=20160428174414"
        },
        {
          "name": "Charles zi Britannia",
          "age": "63",
          "birthday": "August 4, 1955",
          "gender": "Male",
          "height": "197 cm",
          "status": "Deceased",
          "description": "He had a Geass power that allowed him to suppress and alter the memories of those he achieved eye contact with, but lost this power in exchange for V.V.'s code which granted him immortality. He served as the main antagonist in both of the series.",
          "IMGchar": "https://i.pinimg.com/736x/fb/47/7d/fb477d62688c7679a290c98aac94254d.jpg"
        }
      ]
    }
  ]
}
