{"manga": [{"title": "One Piece","synopsis": "Gol D. Roger was known as the \"Pirate King,\" the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece.","demographic": "Shōnen","author": "Eiichiro Oda","genre": "Adventure, fantasy","runDate": "July 22, 1997","endDate": "ongoing","IMG":"https://images-na.ssl-images-amazon.com/images/I/61hgFtFH7YL.jpg"},{"title": "Attack on titan","synopsis": "Eren Yeager lives with his foster sister Mikasa Ackerman and best friend Armin Arlert in the town of Shiganshina adjacent to Wall Maria, outermost of three circular walls protecting humanity from man-eating Titans that are said to have killed all other humans one hundred years prior.", "demographic": "Shōnen","author": "Hajime Isayama","genre": "Action, dark fantasy, post-apocalyptic","runDate": "September 9, 2009","endDate": "ongoing","IMG": "https://images-na.ssl-images-amazon.com/images/I/618khoeeNbL._SY741_.jpg"},{"title":"Nanatsu no taizai","synopsis":"In a world similar to the European Middle Ages, the feared yet revered Holy Knights of Britannia use immensely powerful magic to protect the region of Britannia and its kingdoms. However, a small subset of the Knights supposedly betrayed their homeland and turned their blades against their comrades in an attempt to overthrow the ruler of Liones. They were defeated by the Holy Knights, but rumors continued to persist that these legendary knights, called the \"Seven Deadly Sins,\" were still alive. Ten years later, the Holy Knights themselves staged a coup d’état, and thus became the new, tyrannical rulers of the Kingdom of Liones.","demographic":"Shōnen","author":"Nakaba Suzuki","genre":"Action, Adventure, Fantasy","runDate":"October 10, 2012","endDate":"ongoing","IMG":"https://i.pinimg.com/originals/d4/98/a7/d498a7ef460bf653b603d91cc03d051b.jpg"},{"title":"Code geass","synopsis":"After invading Japan using giant robot weapons called Knightmares, he powerful Empire of Britannia takes over the country and renames it \"Area 11\" and its people, \"Elevens.\"","demographic":"Seinen","author": "Ichirō Ōkouchi","genre": "Alternate history, mecha, military","runDate": "December 26, 2006","endDate": "August 9, 2008","IMG": "https://images-na.ssl-images-amazon.com/images/I/71b6uVcU8aL._SL1200_.jpg"},{"title":"Tokyo Ghoul","synopsis":"Is set in an alternate reality where ghouls, creatures that look like normal people but can only survive by eating human flesh, live amongst the human population in secrecy, hiding their true nature in order to evade pursuit from the authorities. Ghouls have powers including enhanced strength and regenerative abilities - a regular ghoul produces 4–7 times more kinetic energy in their muscles than a normal human; they also have several times the RC cells, a cell that flows like blood and can become solid instantly.","demographic":"Seinen","author":"Sui Ishida","genre":"Dark fantasy, horror, thriller","runDate":"September 8, 2011","endDate":"September 18, 2014","IMG":"https://upload.wikimedia.org/wikipedia/en/e/e5/Tokyo_Ghoul_volume_1_cover.jpg"}]}
