{"manga": [
    {
      "title": "Attack on titan",
      "synopsis": "Eren Yeager lives with his foster sister Mikasa Ackerman and best friend Armin Arlert in the town of Shiganshina adjacent to Wall Maria, outermost of three circular walls protecting humanity from man-eating Titans that are said to have killed all other humans one hundred years prior.",
      "demographic": "Shōnen",
      "author": "Hajime Isayama",
      "genre": "Action, dark fantasy, post-apocalyptic",
      "runDate": "September 9, 2009",
      "endDate": "ongoing",
      "IMG": "https://images-na.ssl-images-amazon.com/images/I/618khoeeNbL._SY741_.jpg",
      "characters": [
        {
          "name": "Eren Yeager",
          "age": "19",
          "birthday": "March 30th",
          "gender": "Male",
          "height": "183 cm",
          "status": "Alive",
          "description": " is a former member of the Survey Corps and the main protagonist of Attack on Titan. He lived in the Shiganshina District with his parents and adopted sister Mikasa Ackerman until the fall of Wall Maria. During the incident, Eren impotently witnessed his mother being eaten by a Titan. This event aroused in Eren an intense hatred towards the Titans, and he swore to wipe all of them off the face of the Earth.",
          "IMGchar": "https://img.pngio.com/eren-jaeger-death-battle-fanon-wiki-fandom-powered-by-wikia-eren-yeager-png-870_919.png"
        },
        {
          "name": "Mikasa Ackerman",
          "age": "19",
          "birthday": "February 10th",
          "gender": "Female",
          "height": "176 cm",
          "status": "Alive",
          "description": "Is the adoptive sister of Eren Yeager and one of the two deuteragonists of the series, along with Armin Arlert. After her biological parents were murdered by human traffickers, Mikasa was rescued by Eren Yeager and lived with him and his parents, Grisha and Carla, before the fall of Wall Maria. She is the last descendant of the Shogun clan that stayed on Paradis Island, thereby related to the Azumabito family, and holds significant political power in Hizuru.\n\nThough she desires only to live a peaceful life, Mikasa entered into the military—where she is considered the best soldier among the 104th Training Corps. She later enlists in the Survey Corps to follow and protect Eren, becoming one of its greatest assets. She is currently serving as an officer in the Corps.",
          "IMGchar": "https://img.pngio.com/mikasa-ackerman-png-7-png-image-mikasa-ackerman-png-827_1169.png"
        },
        {
          "name": "Levi Ackerman",
          "age": "30",
          "birthday": "December 25th",
          "gender": "Male",
          "height": "160 cm",
          "status": "Unknown",
          "description": "Is a Captain in the Survey Corps, rumored to be the strongest soldier alive.",
          "IMGchar": "https://www.elsetge.cat/myimg/f/47-475206_levi-ackerman-wallpaper-79-images-in-collection-page.png"
        },
        {
          "name": "Armin Arlert",
          "age": "19",
          "birthday": "November 3rd",
          "gender": "Male",
          "height": "168 cm",
          "status": "Alive",
          "description": "Is an elite soldier in the Survey Corps. He is also a childhood friend of Eren Yeager and Mikasa Ackerman, and one of the two deuteragonists of the series. Although he appears to be among the physically weakest of the 104th Training Corps, his intelligence and strategic genius make him an invaluable asset, especially when paired with Hange Zoë. After the battle of Shiganshina District, he took the power of the Titans from Bertolt Hoover and became the Colossus Titan. He is currently an officer in the Survey Corps.",
          "IMGchar": "https://static.zerochan.net/Armin.Arlert.full.2585069.png"
        },
        {
          "name": "Erwin Smith",
          "age": "35",
          "birthday": "October 14th",
          "gender": "Male",
          "height": "188 cm",
          "status": "Deceased",
          "description": "Was the 13th commander of the Survey Corps. Discerning, intelligent, and widely respected, Erwin was an able commander. While he cared deeply for his men, he did not hesitate to sacrifice them for the good and prosperity of mankind, and his men proved more than willing to stake their lives at his order. During Erwin's career he developed the Long-Distance Enemy Scouting Formation, and due to uncertainty about his future, he later named Hange Zoë as his successor.",
          "IMGchar": "https://www.anime-planet.com/images/characters/erwin-smith-25700.jpg"
        }
      ]
    },
    {
      "title": "Code geass",
      "synopsis":"After invading Japan using giant robot weapons called Knightmares, the powerful Empire of Britannia takes over the country and renames it \"Area 11\" and its people, \"Elevens.\" In the socially stratified society, the Japanese are forced to live poor, suppressed lives while the Briannians are respected and live lavishly. Although rebel groups of Japanese do rise up, they are usually crushed by Britannia forces.When his mother is assassinated, former prince of Britannia Lelouch renounces his entitlement to the throne and accuses his unconcerned father, the king of Britannia, of leaving his mother defenseless. After being banished to Japan along with his sister Nunnally (who became blind and unable to walk after getting caught up in their mother's violent assassination), Lelouch swears to his best friend Suzaku that he will destroy Britannia some day.",
      "demographic": "Seinen",
      "author": "Ichirō Ōkouchi",
      "genre": "Alternate history, mecha, military",
      "runDate": "December 26, 2006",
      "endDate": "August 9, 2008",
      "IMG": "https://images-na.ssl-images-amazon.com/images/I/71b6uVcU8aL._SL1200_.jpg",
      "characters": [
        {
          "name": "Lelouch vi Britannia",
          "age": "18",
          "birthday": "December 5, 1999",
          "gender": "Male",
          "height": "178 cm",
          "status": "Deceased",
          "description": "Is the protagonist of Code Geass: Lelouch of the Rebellion and Code Geass: Lelouch of the Rebellion R2, and plays a supporting role in sidestories like Code Geass: Oz the Reflection and Code Geass: Lancelot & Guren. After he was exiled he used the alias, Lelouch Lamperouge. He was the Eleventh Prince of the Holy Britannian Empire and the son of the 98th Emperor of Britannia, Charles zi Britannia. He was also the leader of the Black Knights and the real identity of Zero. He is voiced by Jun Fukuyama, while his child self is voiced by Sayaka Ohara. His English dub voice is provided by Johnny Yong Bosch with Michelle Ruff doing Lelouch's child voice.",
          "IMGchar": "https://i.ytimg.com/vi/7PtggAmd5wk/maxresdefault.jpg"
        },
        {
          "name": "C.C.",
          "age": "16",
          "birthday": "Unknown",
          "gender": "Female",
          "height": "168 cm",
          "status": "Alive",
          "description": "Is the tritagonist of Code Geass: Lelouch of the Rebellion. Her seiyu is Yukana while she is voiced by Kate Higgins in the English dub. C.C. is not her real name; she involuntarily reveals her real name to Lelouch in her sleep, but it is muted so the viewers cannot hear it.",
          "IMGchar": "https://toppng.com/uploads/preview/cc-code-geass-11562990728dk3bcqmufn.png"
        },
        {
          "name": "Suzaku Kururugi",
          "age": "18",
          "birthday": "July 10, 2000",
          "gender": "Male",
          "height": "1.76 m",
          "status": "Alive",
          "description": "Is the deuteragonist of the Sunrise anime series Code Geass: Lelouch of the Rebellion, one of the antagonists of Code Geass: Akito the Exiled, and one of the protagonists of Code Geass: Lancelot & Guren. He is voiced by Takahiro Sakurai, while his child self is voiced by Akeno Watanabe. He is voiced by Yuri Lowenthal in the English dub, and his child self is voiced by Laura Bailey. In the 29th Anime Grand Prix, he was placed sixth with 143 votes, then 19th and 13th, respectively, in the following two.",
          "IMGchar": "https://www.pikpng.com/pngl/m/336-3362373_code-geass-suzaku-kururugi-png-png-download-code.png"
        },
        {
          "name": "Cornelia li Britannia",
          "age": "28",
          "birthday": "January 13th 1990",
          "gender": "Female",
          "height": "180 cm",
          "status": "Alive",
          "description": "Is the second princess of the Britannian Imperial Family and is Lelouch's half-sister. She is extremely skilled in Knightmare Frame combat and completed the establishment of Area 18 shortly before arriving in Area 11. She serves as one of the main antagonists during the first season, but later becomes a neutral character during the second.",
          "IMGchar": "https://vignette.wikia.nocookie.net/codegeass/images/2/24/Cornelia_li_Britannia.jpg/revision/latest/scale-to-width-down/340?cb=20160428174414"
        },
        {
          "name": "Charles zi Britannia",
          "age": "63",
          "birthday": "August 4, 1955",
          "gender": "Male",
          "height": "197 cm",
          "status": "Deceased",
          "description": "He had a Geass power that allowed him to suppress and alter the memories of those he achieved eye contact with, but lost this power in exchange for V.V.'s code which granted him immortality. He served as the main antagonist in both of the series.",
          "IMGchar": "https://i.pinimg.com/736x/fb/47/7d/fb477d62688c7679a290c98aac94254d.jpg"
        }
      ]
    }
  ]
}
